[
  {
    "title":{
      "es":"Título Español",
      "en":"English Title"
    },
    "description": {
      "es":"Descripción.",
      "en":"Description"
    },
    "categories": [
      "desarrollo",
      "javascript"
    ],
    "type": "Blog",
    "updatedAt": 1514416055741,
    "createdAt": 1514416055741,
    "banner": "https://caicedo1089.github.io/server/blog/1/imgBanner.png",
    "url": {
      "en": "/blog/1",
      "es": "/blog/1"
    }
  },
  {
    "title":{
      "es":"Visualización de volúmenes utilizando funciones de transferencia multidimensionales",
      "en":"Volume rendering using multidimensional transfer functions"
    },
    "description": {
      "es":"En este trabajo se realiza una implementación de una función de transferencia multidimensional, expandiendo su dominio a través de la magnitud del gradiente y la segunda derivada direccional a lo largo del gradiente, estos cálculos fueron obtenidos por el método de reconstrucción de suma de convoluciones. Además se implementó una interfaz basada en widget para la edición de la función de transferencia. Las pruebas demuestran que las funciones de transferencia multidimensionales permiten mejorar la especificación de la clasificación en los volúmenes, pudiendo aislar partes del volumen de manera efectiva.",
      "en":"In this work an implementation of a multidimensional transfer function is performed, expanding its domain through the magnitude of the gradient and the second directional derivative along the gradient, these calculations were obtained by the method of reconstruction of sum of convolutions. In addition, a widget-based interface was implemented for editing the transfer function. The tests show that the multidimensional transfer functions allow to improve the specification of the classification in the volumes, being able to isolate parts of the volume in an effective way."
    },
    "categories": [
      "Computación Gráfica",
      "Investigación"
    ],
    "type": "project",
    "updatedAt": 1514416055741,
    "createdAt": 1514416055741,
    "banner": "https://caicedo1089.github.io/server/projects/1/imgBanner.png",
    "url": {
      "en": "/projects/1",
      "es": "/projects/1"
    }
  }
]